Light source is inside solid geometry. No light will be emitted during rendering.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId LightSourceInsideGeometry { get; }
  Visual Basic
Public Shared ReadOnly Property LightSourceInsideGeometry As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ LightSourceInsideGeometry {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RenderFailures Class
  Autodesk.Revit.DB Namespace